#include <iostream>
#include "clienthead.h"

////////////////методы класса Client///////////////////////
//в конструкторе задаём имя клиента и остальную информацию
Client::Client(string n, int Num, string Serv, string Mas, int DT, int SM, string comm)
{
/* тут пусто */
}
//---------------------------------------------------------
Client::~Client() // деструктор
{
/* тут тоже пусто */
}
//--------------------------------------------------------
string Client::getName() //геттер возвращает
{
return name;
}
//---------------------------------------------------------
int Client::getNumber() //геттер возвращает
{
return number;
}
//--------------------------------------------------------
string Client::getService() //
{
return service;
}
//--------------------------------------------------------
string Client::getMaster() //
{
return master;
}
//--------------------------------------------------------
string Client::getDate() //
{
return data;
}
//--------------------------------------------------------
string Client::getSum() //
{
return sum;
}
//--------------------------------------------------------
string Client::getComment() //
{
return comment;
}
//--------------------------------------------------------

